app/Models/UserModel.php

    public function connect($postData) {
        $user = $this->where('email', $postData['email'])->get()->getRowArray();
        if ($user) {
            if (!password_verify($postData['password'], $user['password'])) {
                $user = false;
                return 'Password is not correct.';
            } else {
                $this->update($user['id_user'], ['last_login' => date('Y-m-d')]);
---
SELECT *
FROM `user`
WHERE `email` = 'jeremy.khezzeri@gmail.com'
UPDATE `user` SET `last_login` = '2023-11-15'
WHERE `user`.`id_user` IN ('1')

    public function getUserData($username) {
        return $this->where('username', $username)->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'jkhezzeri'